import styles from "./InfoAbComp.module.scss";
import { Logo } from "../../../assets/icons/Logo";
export const InfoAbComp = () => {
  return (
    <>
      <section className={styles.hero}>
        <div className={styles.content}>
          <h1>Лидер в мире спортивных достижений с момента основания</h1>
          <span>
            Мы вдохновляемся спортсменами. С первых кроссовок, созданных в
            мастерской, наша миссия — разрабатывать лучшее снаряжение для
            достижения максимальных результатов. Nike постоянно стремится к
            технологическим прорывам и инновационным дизайнерским решениям.
            <br /> Наши кроссовки и одежда используются мировыми рекордсменами и
            обладателями медалей. В то же время мы создаем продукты для
            бегунов-любителей, уикенд-хайкеров, футбольных энтузиастов и всех,
            кто стремится к активному образу жизни. <br /> От революционной
            амортизации Nike Air до легендарных кроссовок Pegasus и
            инновационной экипировки для бега — мы постоянно развиваемся, чтобы
            создавать лучшее с учетом нужд спортсменов.
            <br />
            <strong>Сила стиля, выходящего за рамки спорта</strong>
            <br />
            Легендарный логотип Swoosh стал символом не только спортивных
            достижений, но и культурных изменений. <br /> Кроссовки Nike носят
            не только спортсмены, но и музыканты, скейтбордисты, художники и те,
            кто формирует культуру благодаря своему видению и уникальному стилю.
            Модели, такие как Air Max, Air Force 1 и Dunk, изначально
            создавались для спорта, но оставили неизгладимый след в уличной
            моде.
            <br />
            <strong>Современный стиль с наследием спорта</strong>
            <br />
            Коллекции Nike Sportswear гармонично сочетают спортивное наследие с
            современными тенденциями. <br /> Мы черпаем вдохновение в наших
            архивах, чтобы переосмыслить классические силуэты и добавить в них
            современные детали. <br /> Премиальные материалы, продуманный дизайн
            и внимание к деталям подчеркивают стиль, который остается актуальным
            как на улицах, так и в спортивной среде. <br /> В Nike мы верим, что
            через спорт можно изменить жизнь. <br /> И эта вера лежит в основе
            всего, что мы делаем.
          </span>
          <Logo color={"#fff"} />
        </div>
      </section>
    </>
  );
};
